---
kind: other
id: Properties.T:Autodesk.Revit.DB.UpdaterData
source: html/01b1f8e9-b680-f871-3fab-c397b96dc5ef.htm
---
# UpdaterData Properties

Specifies whether the .NET object represents a valid Revit entity.